In [1]:
import duckdb
import pandas as pd
import os 
from datetime import datetime

In [63]:
con = duckdb.connect(database='dados_duckdb.db', read_only=False)

In [42]:
# fazendo a leitura dos CSV

arquivo = 'z0019_1.csv'
data_ingestao = datetime.now()
df = pd.read_csv(f'../landing/{arquivo}', sep=';')
df['nome_arquivo'] = arquivo
df['data_ingestao'] = data_ingestao #colunas adicionais
df.head()

   NATBR     MAKTX WERKS  MANIS  LABST nome_arquivo              data_ingestao
0  10001  PARAFUSO  BT10    100    100  z0019_1.csv 2026-01-28 21:48:27.420882
1  10002   MARTELO  BT50    100   1500  z0019_1.csv 2026-01-28 21:48:27.420882
2  10003     PREGO  BT10    100     50  z0019_1.csv 2026-01-28 21:48:27.420882

# criando a  tabela Bronze

In [49]:
con.execute("""
    CREATE TABLE IF NOT EXISTS bronze_produtos (
            NATBR VARCHAR, 
            MAKTX VARCHAR, 
            WERKS VARCHAR, 
            MANIS VARCHAR, 
            LABST VARCHAR, 
            nome_arquivo VARCHAR, 
            data_ingestao TIMESTAMP,
        )
""")

## Ingest√£o dos dados na tabela que criamos

In [48]:
con.execute("DROP TABLE IF EXISTS bronze_produtos")

In [50]:
con.execute("INSERT INTO bronze_produtos SELECT * FROM df")

In [51]:
resultado = con.execute("""SELECT * FROM bronze_produtos""").fetchdf()
resultado.head()

   NATBR     MAKTX WERKS MANIS LABST nome_arquivo              data_ingestao
0  10001  PARAFUSO  BT10   100   100  z0019_1.csv 2026-01-28 21:48:27.420882
1  10002   MARTELO  BT50   100  1500  z0019_1.csv 2026-01-28 21:48:27.420882
2  10003     PREGO  BT10   100    50  z0019_1.csv 2026-01-28 21:48:27.420882

In [52]:
# fazendo a leitura dos CSV 2 

arquivo = 'z0019_2.csv'
data_ingestao = datetime.now()
df = pd.read_csv(f'../landing/{arquivo}', sep=';')
df['nome_arquivo'] = arquivo
df['data_ingestao'] = data_ingestao #colunas adicionais
df.head()

   NATBR    MAKTX WERKS  MANIS  LABST nome_arquivo              data_ingestao
0  10004    SERRA  BT50    100    200  z0019_2.csv 2026-01-28 21:56:15.244751
1  10005  MACHADO  BT50    100    100  z0019_2.csv 2026-01-28 21:56:15.244751
2  10003    PREGO  BT10    100     60  z0019_2.csv 2026-01-28 21:56:15.244751

In [53]:
con.execute("""
    CREATE TABLE IF NOT EXISTS bronze_produtos (
            NATBR VARCHAR, 
            MAKTX VARCHAR, 
            WERKS VARCHAR, 
            MANIS VARCHAR, 
            LABST VARCHAR, 
            nome_arquivo VARCHAR, 
            data_ingestao TIMESTAMP,
        )
""")

In [56]:
resultado = con.execute("""SELECT * FROM bronze_produtos""").fetchdf()
resultado.head()

   NATBR     MAKTX WERKS MANIS LABST nome_arquivo              data_ingestao
0  10001  PARAFUSO  BT10   100   100  z0019_1.csv 2026-01-28 21:48:27.420882
1  10002   MARTELO  BT50   100  1500  z0019_1.csv 2026-01-28 21:48:27.420882
2  10003     PREGO  BT10   100    50  z0019_1.csv 2026-01-28 21:48:27.420882
3  10004     SERRA  BT50   100   200  z0019_2.csv 2026-01-28 21:56:15.244751
4  10005   MACHADO  BT50   100   100  z0019_2.csv 2026-01-28 21:56:15.244751

In [55]:
con.execute("INSERT INTO bronze_produtos SELECT * FROM df")

In [69]:
resultado = con.execute("""SELECT * FROM bronze_z0019""").fetchdf()
resultado.head(7)

   NATBR     MAKTX WERKS MANIS LABST nome_arquivo              data_ingestao
0  10001  PARAFUSO  BT10   100   100  z0019_1.csv 2026-01-28 21:48:27.420882
1  10002   MARTELO  BT50   100  1500  z0019_1.csv 2026-01-28 21:48:27.420882
2  10003     PREGO  BT10   100    50  z0019_1.csv 2026-01-28 21:48:27.420882
3  10004     SERRA  BT50   100   200  z0019_2.csv 2026-01-28 21:56:15.244751
4  10005   MACHADO  BT50   100   100  z0019_2.csv 2026-01-28 21:56:15.244751
5  10003     PREGO  BT10   100    60  z0019_2.csv 2026-01-28 21:56:15.244751

In [68]:
con.execute("ALTER TABLE bronze_0019 RENAME TO bronze_z0019")

In [70]:
con.close()